Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotHorz Property
 The Floor or Roof or Toposolid is no longer horizontal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeFailedNotHorz { get; }
Public Shared ReadOnly Property SlabShapeFailedNotHorz As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeFailedNotHorz {
	FailureDefinitionId^ get ();
}
static member SlabShapeFailedNotHorz : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace